import pandas as pd

# 1. Завантаження файлу
df = pd.read_csv("titanic.csv")

# 2. Перші 10 рядків
print("Перші 10 рядків:")
print(df.head(10))

# 3. Кількість пасажирів віком < 18
under_18 = len(df[df['Age'] < 18])
print("\nКількість пасажирів віком < 18:", under_18)

# 4. Кількість пасажирів віком > 18 і 1 клас
over_18_class1 = len(df[(df['Age'] > 18) & (df['Pclass'] == 1)])
print("Кількість пасажирів віком > 18 і 1 клас:", over_18_class1)

# 5. Кількість пасажирів віком > 18 і 3 клас
over_18_class3 = len(df[(df['Age'] > 18) & (df['Pclass'] == 3)])
print("Кількість пасажирів віком > 18 і 3 клас:", over_18_class3)

# 6. Кількість чоловіків / жінок
print("\nКількість чоловіків і жінок:")
print(df['Sex'].value_counts())

# 7. Кількість пасажирів < 18 і > 18
print("\nКількість пасажирів віком < 18:", (df['Age'] < 18).sum())
print("Кількість пасажирів віком > 18:", (df['Age'] > 18).sum())

# 8. Кількість пасажирів < / > 18 у 1 та 3 класі
print("\n<18 і 1 клас:", len(df[(df['Age'] < 18) & (df['Pclass'] == 1)]))
print("<18 і 3 клас:", len(df[(df['Age'] < 18) & (df['Pclass'] == 3)]))
print(">18 і 1 клас:", len(df[(df['Age'] > 18) & (df['Pclass'] == 1)]))
print(">18 і 3 клас:", len(df[(df['Age'] > 18) & (df['Pclass'] == 3)]))
